
from enum import Enum

class Faction(Enum):
    魏 = '魏'
    蜀 = '蜀'
    吴 = '吴'
    群 = '群'

class WeaponType(Enum):
    盾 = '盾'
    骑 = '骑'
    枪 = '枪'
    弓 = '弓'

class HeroInfoKey(Enum):

    持有Soul列表 = '持有Soul列表'
    响应Soul列表 = '响应Soul列表'
    
    武将信息 = '武将信息'
    队伍名称 = '队伍名称'

    武将名称 = '武将名称'
    武将阵营 = '武将阵营'
    武将兵种 = '武将兵种'
    武将性别 = '武将性别'

    武力 = '武力'
    初始武力 = '初始武力'
    武力成长 = '武力成长'
    武力加点 = '武力加点'

    智力 = '智力'
    初始智力 = '初始智力'
    智力成长 = '智力成长'
    智力加点 = '智力加点'

    统帅 = '统帅'
    初始统帅 = '初始统帅'
    统帅成长 = '统帅成长'
    统帅加点 = '统帅加点'

    先攻 = '先攻'
    初始先攻 = '初始先攻'
    先攻成长 = '先攻成长'
    先攻加点 = '先攻加点'

    武将升阶 = 'rank_info'
    武将升品 = 'premium_info'

    缘分列表 = '缘分列表'
    自带战法 = '自带战法'
    第一战法 = '第一战法'
    第一战法升阶 = '第一战法升阶'
    第二战法 = '第二战法'
    第二战法升阶 = '第二战法升阶'

    被击溃状态 = '被击溃状态'
    兵力 = '兵力'
    等级 = '等级'

    伤兵 = '伤兵'
    亖兵 = '亖兵'

    前排 = '前排'
    已行动状态 = '已行动状态'
    受击率 = '受击率'
    固定受击率 = '固定受击率'

    连击几率 = '连击几率'
    规避 = '规避'
    会心几率 = '会心几率'
    会心伤害 = '会心伤害'
    奇谋几率 = '奇谋几率'
    奇谋伤害 = '奇谋伤害'

    抵御 = '抵御'
    攻心 = '攻心'
    受治疗效果 = '受治疗效果'

    造成伤害提升 = '造成伤害提升'
    造成伤害降低 = '造成伤害降低'
    受到伤害提升 = '受到伤害提升'
    受到伤害降低 = '受到伤害降低'

    受到异性伤害提升 = '受到异性伤害提升'
    受到异性伤害降低 = '受到异性伤害降低'

    对前排造成伤害提升 = '对前排造成伤害提升'
    对前排造成伤害降低 = '对前排造成伤害降低'

    造成谋略伤害提升 = '造成谋略伤害提升'
    造成谋略伤害降低 = '造成谋略伤害降低'
    受到谋略伤害提升 = '受到谋略伤害提升'
    受到谋略伤害降低 = '受到谋略伤害降低'

    造成兵刃伤害提升 = '造成兵刃伤害提升'
    造成兵刃伤害降低 = '造成兵刃伤害降低'
    受到兵刃伤害提升 = '受到兵刃伤害提升'
    受到兵刃伤害降低 = '受到兵刃伤害降低'

    普通攻击造成伤害提升 = '普通攻击造成伤害提升'
    普通攻击造成伤害降低 = '普通攻击造成伤害降低'
    受到普通攻击伤害提升 = '受到普通攻击造成伤害提升'
    受到普通攻击伤害降低 = '受到普通攻击造成伤害降低'

    主动战法造成伤害提升 = '主动战法造成伤害提升'
    主动战法造成伤害降低 = '主动战法造成伤害降低'
    受到主动战法伤害提升 = '受到主动战法造成伤害提升'
    受到主动战法伤害降低 = '受到主动战法造成伤害降低'

    追击战法造成伤害提升 = '追击战法造成伤害提升'
    追击战法造成伤害降低 = '追击战法造成伤害降低'
    受到追击战法伤害提升 = '受到追击战法造成伤害提升'
    受到追击战法伤害降低 = '受到追击战法造成伤害降低'

    主动战法基础发动率 = '主动战法基础发动率'

    TeamOrder = 'teamorder'

    D_SkillClass = 'D_SkillClass'
    F_SkillClass = 'F_SkillClass'
    S_SkillClass = 'S_SkillClass'
    P_SkillClass = 'P_SkillClass'


