
from enum import Enum

class Generals_Name_Enum(Enum):

    测试武将_A1 = "测试武将_A1"
    测试武将_A2 = "测试武将_A2"
    测试武将_A3 = "测试武将_A3"
    测试武将_B1 = "测试武将_B1"
    测试武将_B2 = "测试武将_B2"
    测试武将_B3 = "测试武将_B3"

    # 蜀 盾
    刘备 = "刘备"
    诸葛亮SP = "诸葛亮(SP)"
    姜维 = "姜维"
    法正 = "法正"
    庞统 = "庞统"
    徐庶 = "徐庶"
    
    # 蜀 弓
    甘夫人 = "甘夫人"
    
    # 未初始化 受缘分影响提前引入
    诸葛亮 = "诸葛亮"
    黄月英 = "黄月英"
    关羽 = "关羽"
    张飞 = "张飞"
    赵云 = "赵云"

    # 吴 其他
    孙权 = "孙权"
    孙尚香 = "孙尚香"

    # 魏 其他
    曹操 = "曹操"
    司马懿 = "司马懿"

    # 吴 其他
    周瑜 = "周瑜"

    # 其他女性武将
    貂蝉 = "貂蝉"
    蔡文姬 = "蔡文姬"
    邹氏 = "邹氏"
    王异 = "王异"
    甄洛 = "甄洛"

    
    
