
from enum import Enum

class Generals_Name_Enum(Enum):

    测试武将_A1 = "测试武将_A1"
    测试武将_A2 = "测试武将_A2"
    测试武将_A3 = "测试武将_A3"
    测试武将_B1 = "测试武将_B1"
    测试武将_B2 = "测试武将_B2"
    测试武将_B3 = "测试武将_B3"

    # 蜀 盾
    刘备 = "刘备"
    诸葛亮SP = "诸葛亮(SP)"
    
    # 蜀 弓
    甘夫人 = "甘夫人"
    诸葛亮 = "诸葛亮"
    黄月英 = "黄月英"

    # 蜀 骑
    赵云 = "赵云"
    关羽 = "关羽"
    关银屏 = "关银屏"

    # 魏 弓     
    荀攸 = "荀攸"
    # 魏 枪
    许褚 = "许褚"


    # 未初始化 受缘分影响提前引入
    张飞 = "张飞"
    吕布 = "吕布"
    马超 = "马超"
    黄忠 = "黄忠"
    姜维 = "姜维"
    法正 = "法正"
    庞统 = "庞统"
    徐庶 = "徐庶"
    孙权 = "孙权"
    孙尚香 = "孙尚香"
    曹操 = "曹操"
    司马懿 = "司马懿"
    周瑜 = "周瑜"
    貂蝉 = "貂蝉"
    蔡文姬 = "蔡文姬"
    邹氏 = "邹氏"
    王异 = "王异"
    甄洛 = "甄洛"
    荀彧 = "荀彧"
    程昱 = "程昱"
    贾诩 = "贾诩"
    郭嘉 = "郭嘉"
    典韦 = "典韦"
    徐晃 = "徐晃"
    凌统 = "凌统"
    # 吴 弓
    张昭 = "张昭"
    
    # 群 盾
    左慈 = "左慈"
    
    
