
from enum import Enum

class DamageType(Enum):
    谋略 = 1
    兵刃 = 2
    逃兵 = 3
    择优 = 4

class ResponseStatus(Enum):
    阵型结束 = '阵型结束'
    战法布阵开始 = '战法布阵开始'
    回合开始时 = '回合开始时'
    每回合行动时 = '回合行动时'
    普攻行动时 = '普攻行动时'
    每回合结束时 = '每回合结束时'
    武将溃败 = '武将溃败'
    造成伤害时 = '造成伤害时'
    受到伤害时 = '受到伤害时'
    每回合重置阶段 = '每回合重置阶段'

class SkillFeature(Enum):
    辅助 = '辅助'
    谋略 = '谋略'
    普攻 = '普攻'

class SkillType(Enum):
    指挥 = '指挥'
    主动 = '主动'
    被动 = '被动'
    追击 = '追击'
    普攻 = '普攻'

class SkillName(Enum):
    普攻 = "普攻"
    星罗棋布 = "星罗棋布"
    草船借箭 = "草船借箭"
    七进七出 = "七进七出"
    骁勇无前 = "骁勇无前"
    皇思淑仁 = "皇思淑仁"
    携民渡江 = "携民渡江"
    九伐中原 = "九伐中原"

class SkillInfoKey(Enum):

    战法信息 = '战法信息'
    战法名称 = '战法名称'
    战法类型 = '战法类型'
    战法特征 = '战法特征'
    适应兵种 = '适应兵种'
    发动率 = '发动率'
    战法响应时机列表 = '战法响应时机列表'
    持有者 = '持有者'
    加载状态 = '加载状态'
    战法升阶 = '战法升阶'
    Soul_list = 'Soul_list'

class Faction(Enum):
    魏 = '魏'
    蜀 = '蜀'
    吴 = '吴'
    群 = '群'

class WeaponType(Enum):
    盾 = '盾'
    骑 = '骑'
    枪 = '枪'
    弓 = '弓'

class HeroInfoKey(Enum):

    持有Soul列表 = '持有Soul列表'
    响应Soul列表 = '响应Soul列表'
    
    武将信息 = '武将信息'
    队伍名称 = '队伍名称'

    武将名称 = '武将名称'
    武将阵营 = '武将阵营'
    武将兵种 = '武将兵种'
    武将性别 = '武将性别'

    武力 = '武力'
    初始武力 = '初始武力'
    武力成长 = '武力成长'
    武力加点 = '武力加点'

    智力 = '智力'
    初始智力 = '初始智力'
    智力成长 = '智力成长'
    智力加点 = '智力加点'

    统帅 = '统帅'
    初始统帅 = '初始统帅'
    统帅成长 = '统帅成长'
    统帅加点 = '统帅加点'

    先攻 = '先攻'
    初始先攻 = '初始先攻'
    先攻成长 = '先攻成长'
    先攻加点 = '先攻加点'

    武将升阶 = 'rank_info'
    武将升品 = 'premium_info'

    自带战法 = '自带战法'
    第一战法 = '第一战法'
    第一战法升阶 = '第一战法升阶'
    第二战法 = '第二战法'
    第二战法升阶 = '第二战法升阶'

    被击溃状态 = '被击溃状态'
    兵力 = '兵力'
    等级 = '等级'

    伤兵 = '伤兵'
    亖兵 = '亖兵'

    前排 = '前排'
    已行动状态 = '已行动状态'
    受击率 = '受击率'
    固定受击率 = '固定受击率'

    连击几率 = '连击几率'
    闪避几率 = '闪避几率'
    会心几率 = '会心几率'
    奇谋几率 = '奇谋几率'

    攻心 = '攻心'

    造成伤害提升 = '造成伤害提升'
    造成伤害降低 = '造成伤害降低'
    对前排造成伤害提升 = '对前排造成伤害提升'
    对后排造成伤害提升 = '对后排造成伤害提升'
    受到伤害降低 = '受到伤害降低'
    受到伤害提升 = '受到伤害提升'
    受到谋略伤害降低 = '受到谋略伤害降低'

    TeamOrder = 'teamorder'

    D_SkillClass = 'D_SkillClass'
    F_SkillClass = 'F_SkillClass'
    S_SkillClass = 'S_SkillClass'
    P_SkillClass = 'P_SkillClass'

class Formation(Enum):
    一字阵 = '一字阵'
    萁型阵 = '萁型阵'
    雁型阵 = '雁型阵'
    方圆阵 = '方圆阵'
    锥型阵 = '锥型阵'
    鱼鳞阵 = '鱼鳞阵'
    钩型阵 = '钩型阵'
    偃月阵 = '偃月阵'

class SoulSourceType(Enum):
    不溯源 = '不溯源'

    阵型加成 = '阵型加成'

    星罗棋布_阵型强化 = '星罗棋布_阵型强化'

    武将战法 = '武将战法'

class SoulResponseTime(Enum):
    None_Response = 'None_Response'
    BEFORE_SKILL = 'before_skill'
    AFTER_SKILL = 'after_skill'

class SoulEffectType(Enum):

    无影响 = '无影响'

    造成伤害 = '造成伤害'
    对前排造成伤害 = '对前排造成伤害'
    对后排造成伤害 = '对后排造成伤害'

    受到伤害 = '受到伤害'
    受到谋略伤害 = '受到谋略伤害'

    武力 = '武力'
    智力 = '智力'
    统帅 = '统帅'
    先攻 = '先攻'

    攻心 = '攻心'            

    连击 = '连击'            
    闪避 = '闪避'        
    会心 = '会心'       
    奇谋 = '奇谋'     

    固定受击率 = '固定受击率'

    损失兵力 = '损失兵力'

    星罗棋布_双前排阵型 = '星罗棋布_双前排阵型'
    星罗棋布_三前排阵型 = '星罗棋布_三前排阵型'

    草船借箭 = '草船借箭'

class SimulatorMode(Enum):

    VS_1 = 'VS_1'
    VS_Team = 'VS_Team'
    VS_Random = 'VS_Random'

