
from enum import Enum

class SoulEffectType(Enum):
    无影响 = '无影响'

    待响应 = '待响应'

    造成伤害 = '造成伤害'
    对前排造成伤害 = '对前排造成伤害'
    对后排造成伤害 = '对后排造成伤害'

    受到伤害 = '受到伤害'
    受到伤害_绝对值 = '受到伤害_绝对值'
    受到谋略伤害 = '受到谋略伤害'

    武力 = '武力'
    智力 = '智力'
    统帅 = '统帅'
    先攻 = '先攻'

    攻心 = '攻心'
    受治疗效果 = '受治疗效果'

    连击 = '连击'            
    闪避 = '闪避'   

    会心几率 = '会心几率'
    会心伤害 = '会心伤害'
    奇谋几率 = '奇谋几率'
    奇谋伤害 = '奇谋伤害'

    固定受击率 = '固定受击率'

    损失兵力 = '损失兵力'

    清醒 = '清醒'
    震慑 = '震慑'
    缴械 = '缴械'
    技穷 = '技穷'
    混乱 = '混乱'
    嘲讽 = '嘲讽'
    虚弱 = '虚弱'
    断粮 = '断粮'
    洪水 = '洪水'
    火攻 = '火攻'
    风暴 = '风暴'
    畏惧 = '畏惧'
    妖术 = '妖术'