
from enum import Enum

class SoulEffectType(Enum):
    无影响 = '无影响'

    待响应 = '待响应'

    武力 = '武力'
    智力 = '智力'
    统帅 = '统帅'
    先攻 = '先攻'

    攻心 = '攻心'
    受治疗效果 = '受治疗效果'

    连击几率 = '连击几率'            
    规避 = '规避'   

    会心几率 = '会心几率'
    会心伤害 = '会心伤害'
    奇谋几率 = '奇谋几率'
    奇谋伤害 = '奇谋伤害'

    固定受击率 = '固定受击率'

    损失兵力 = '损失兵力'
    恢复兵力 = '恢复兵力'

    清醒 = '清醒'
    震慑 = '震慑'
    缴械 = '缴械'
    技穷 = '技穷'
    混乱 = '混乱'
    嘲讽 = '嘲讽'
    虚弱 = '虚弱'
    断粮 = '断粮'
    洪水 = '洪水'
    火攻 = '火攻'
    风暴 = '风暴'
    畏惧 = '畏惧'
    妖术 = '妖术'

    造成伤害提升 = '造成伤害提升'
    造成伤害降低 = '造成伤害降低'
    受到伤害提升 = '受到伤害提升'
    受到伤害降低 = '受到伤害降低'

    受到异性伤害提升 = '受到异性伤害提升'
    受到异性伤害降低 = '受到异性伤害降低'

    对前排造成伤害提升 = '对前排造成伤害提升'
    对前排造成伤害降低 = '对前排造成伤害降低'

    造成谋略伤害提升 = '造成谋略伤害提升'
    造成谋略伤害降低 = '造成谋略伤害降低'
    受到谋略伤害提升 = '受到谋略伤害提升'
    受到谋略伤害降低 = '受到谋略伤害降低'

    造成兵刃伤害提升 = '造成兵刃伤害提升'
    造成兵刃伤害降低 = '造成兵刃伤害降低'
    受到兵刃伤害提升 = '受到兵刃伤害提升'
    受到兵刃伤害降低 = '受到兵刃伤害降低'

    普通攻击造成伤害提升 = '普通攻击造成伤害提升'
    普通攻击造成伤害降低 = '普通攻击造成伤害降低'
    受到普通攻击伤害提升 = '受到普通攻击造成伤害提升'
    受到普通攻击伤害降低 = '受到普通攻击造成伤害降低'

    主动战法造成伤害提升 = '主动战法造成伤害提升'
    主动战法造成伤害降低 = '主动战法造成伤害降低'
    受到主动战法伤害提升 = '受到主动战法造成伤害提升'
    受到主动战法伤害降低 = '受到主动战法造成伤害降低'

    追击战法造成伤害提升 = '追击战法造成伤害提升'
    追击战法造成伤害降低 = '追击战法造成伤害降低'
    受到追击战法伤害提升 = '受到追击战法造成伤害提升'
    受到追击战法伤害降低 = '受到追击战法造成伤害降低'
    